[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "In this post, we critique the visualisation and propose an alternative to address the samll problems.",
    "author": [
      {
        "name": "Xu Dan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nThe title and notes of the data visualization do not convey the information well. We cannot read why these countries/regions are displayed in this chart.\r\nThe x-axis and y-axis label numbers without scale and units, which make it ambiguity as readers cannot recognize directly what the x and y axis indicate.\r\nThe plot did not indicate the information given by the blue box in the bottom.\r\nThe places of the two bubbles are quite confused as the place of the central white point for each circle is not very easy to identify, especially for those countries who are on or near the diagonal line.\r\nThe position of ‘Exports’ and ‘Imports’ for x-axis and y-axis are quite confused. It will be much clearer to place them below or in the left of the axis center.\r\n1.2 Aesthetics\r\nThe bubbles overlap each other, make it hard to see the exact area it located to tell the ‘net importer’ of ‘net exporter’\r\nThe size of these bubbles is relatively too large. When several bubbles overlap each other, the importance of the data is occupied.\r\nThe colors and shadings are beautiful and attractive, but, as mentioned above, the focus is the data, so the guest has been declared the master.\r\n2.0 Proposed Design\r\nThe initial sketch of proposed design is as following:\r\n\r\n2.1 Clarity\r\nX-axis and y-axis: chart 1 keep to the primary axis just change to percentile. So, there is no need to care about the units.\r\nChart type: The three graphs describe Singapore’s trading partners from the macro perspective to the micro perspective. As for the bar chart, the trade deficit or trade surplus is also shown based on the zero-value reference line.\r\nTitles: Chart title for each chart is corresponding to the chart.\r\nAnimation is used to show the volume change and trend.\r\n2.2 Aesthetics\r\nLegend: The legend is placed on the right side of the chart. Readers ca\r\nTitle for each chart aligns to the top; choose distinctive font sizes for main visual title and chart title.\r\nChart order and sizing: The largest graph shows the overview of transaction distribution among the overall trading partners. The two small charts on the right are relatively detailed.\r\nSize: Use appropriate size of the circles to display the relative position of those countries/regions.\r\nColors and shading: Remove the overlap between those bubbles. Overlay the area charts with line charts to allow readers to identify the trend easier.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nUnzip the output folder downloaded from the xxx website. Load the outputFile excel into Tableau Prep Builder. Drag the ‘T1’ and ‘T2’ worksheet into the data connection pain.\r\n\r\n2 Select the Data Interpreter and rename ‘T1’ and ‘T2’ to ‘Import’ and ‘Export’, respectively. Then initiate Clean node for each data node.\r\n\r\n3 Under ‘Clean 1’, clean ‘Variables’ using ‘Split Values’ with ‘(’ as the separator. Rename column as ‘Country/Region’. Repeat for ‘Clean 2’.\r\n\r\n4 Add Pivot nodes after ‘Clean 1’ and ‘Clean 2’. Under each pivot, select all months under ‘Fields’ and drag to ‘Pivoted Fields’.\r\n\r\nRename ‘Pivot 1 Names’ to ‘Month’ and change data type to ‘Date’. Rename ‘Pivot 1 Values’ to ‘Import ($1000)’. Repeat for ‘Pivot 2’ but rename as ‘Export ($1000)’.\r\n\r\nDo full join between ‘Pivot 1’ and ‘Pivot 2’ applying ‘Country/Region’ and ‘Month’ clauses.\r\n\r\nDrag and drop one field onto another to merge fields of country/region and month variables.\r\n\r\nCreate ‘Pivot’ node after ‘Clean 3’. Pivot columns to rows for ‘Import ($1000)’ and ‘Export ($1000)’ variables.\r\n\r\nSplit ‘Pivot1 Names’ and rename ‘Pivot1 Names-Split 1’ to ‘Trade Type’. Rename ‘Pivot1 Values’ as ‘Trade Value’. Remove unnecessary fields.\r\n\r\nCreate a ‘Output’ node after ‘Pivot 3’ node and save as ‘Monthly Singapore Merchandise Trade’.\r\n\r\nSet up a connection on Tableau Desktop to the ‘Monthly Singapore Merchandise Trade’ hyper’s extract.\r\n\r\n12 Synchronize Axis and fix both import and export data range fixed from 0 to 80,000,000.\r\n\r\nIn sheet 1, name it ‘Top 10 partners’ and create calculated fields ‘Export+Import’, ‘Export-Import’, ‘Surplus’, and ‘Deficit’.\r\n\r\nDrag ‘Import+Export’ and ‘Import-Export’ to ‘Columns’ and ‘Country/Region’ to ‘Rows’.\r\n\r\nDrag ‘Month’ to ‘Filter Field’ section. Select ‘Range of Dates’ and indicate ‘1/1/2011’ as the start and ‘1/12/2020’ as the end date.\r\n\r\n16 Drag ‘Country/Region’ to the ‘Filter Field’ section. Select the ‘Top’ tab and choose the top 10 by sum of ‘Import+Export’.\r\n\r\n17 Under Marks, select ‘Bar’ under dropdown and drag ‘Surplus’ to ‘Color’. Drag ‘Deficit’ to ‘Tooltip’ and edit color for Surplus and Deficit.\r\n\r\n18 Choose ‘Dual Axis’ under ‘Export-Import’ dropdown list. Click on the X-axis of ‘Export-Import’ and select ‘Synchronize Axis’.\r\n\r\n19 Bold the country values, year, X-axis and Y-axis values. Also set different colors to clarify.\r\n\r\n20 For Chart 2, create a new worksheet and name it as ‘Top n partners’. Drag ‘Import Value’ to Columns and ‘Export Value’ to Rows. Create a parameter called ‘Top n’ and set range of values.\r\n\r\n21 Select Percentile for both ‘Import Value’ and ‘Export Value’ and ‘Compute Using’ as ‘Country/Region’. Drag ‘Export-Import’ to Color and ‘Country/Region’ to Detail.\r\n\r\n22 Edit colors stepped 2 steps.\r\n\r\n23 For Chart 3, create calculated fields of ‘Dif value’, ‘Net Import’ and ‘Net Export’.\r\n\r\n24 Drag ‘Net Import’ and ‘Net Export’ to Rows and drag ‘Month’ to Columns. Repeat previous steps for filtering year range. And then edit title.\r\n\r\n25 Create a ‘Dashboard’. Drag sheets ‘Top n partners’, ‘Trade with Singapore over 2011-2020’, and ‘Top 10 partners’ to the right-hand dashboard. Add a dashboard title as ‘Singapore Merchandise Trade Partners’.\r\n\r\n26 Finally, hide the worksheets and publish the dashboard to Tableau Public.\r\n\r\n5. Major observations\r\nTop n partners: By observing the merchandise transactions of Singapore’s top 10 to top 30 trading partners, we can see that Singapore is a country with a trade deficit, because Singapore has more countries that import goods than countries that export goods.\r\nTop 10 trade partners: over the 10-year period, Malaysia was the most important merchandise trade partner for Singapore in 2011 and 2012 based on its number 1 position of total trade volume. Since 2013, Mainland China began to surpass Malaysia and became the largest partner for Singapore. In year 2020, in terms of total import and export volume, Mainland China is Singapore’s largest trading partner of 136.2 billion dollars. Following by Malaysia of about 100 billion dollars. It is worth noted that Japan and Republic of Korea are on the reference line, their imports and exports with Singapore basically maintained a balance.\r\nTrade balance change: the United States was a net importer for Singapore between 2011 and 2019, while the US suddenly imported $5 billion more than exported from Singapore in 2020. For example, obviously, Uruguay has become a net importer for Singapore since 2017. Net imports increased sharply from 676 thousand U.S. dollars in 2017 to 24658 thousand U.S. dollars in 2019. However, by 2020, this difference has dropped to below 1,000 thousand U.S. dollars.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T01:31:33+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "Xu Dan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\n1. Chart title is not precise\r\nThe title and subtitle of the graph do not convey the intent of the graph well. In this case, the graph is demonstrating the changes in import and export volume 6 trading countries per month over two years. But the title does not mention that the graph is based on monthly data.\r\n2. Axis standard not consistent\r\nIn graph for Hong Kong, y-axis of the export is scaled with ‘M’, but the import is scaled with ‘K’. The x-axis for Japan only shows time data of 2020, but the other 5 countries are over 3-year period from 2019 to 2021.\r\n3. Quantitative scale of y-axis\r\nThe measures on the y-axis of each country are not uniform. However, readers may directly compare the differences between countries based on the height of the points on the line. This can lead to inaccurate and misleading results.\r\n4. Axis title not properly labeled\r\n‘Month of Period’ is title of the x-axis, while the x-axis is shown in year period. This will make the readers very confused about what the horizontal axis represents.\r\n5. Confused shaded color\r\nLine chart with color shading is used. But in this case, the color shading for the area is unnecessary. When the areas overlap, it is difficult for readers to distinguish two legends clearly. In addition, there will be a third color in the part where import and export overlap, which will mislead readers so that people cannot easily tell which legend each color indicates.\r\n1.2 Aesthetic\r\n1. Font size of subtitle for ‘Hong Kong’, ‘Mainland China’ … should be smaller than the that of main title of ‘Merchandise Trade of Top Six Trading Countries’. Also, the subtitles of the six countries above the six charts are not in the middle of the graphic.\r\n2. The use of color shading in the graphics is very unsuccessful. In fact, the shaded color here is not only unnecessary, but also increases the difficulty of reading for readers. The two colors also generate a third color when overlap, which makes the reading of the chart more inaccurate.\r\n3. Different colors are used to demonstrate import and export respectively. However, the shade color makes it even confused for readers to observe as there appear 3 different colors.\r\n4. Legends in the very right-hand side lonely leave room under it.\r\n5. Tick marks on the x-axis are inconsistent. Values on y-axis have no scale, which might confuse readers regarding that the values are absolute values.\r\n2.0 Alternative Design\r\nThe proposed design is inspired by Tamás Varga and is shown as follows.\r\n\r\n2.1 Advantages of proposed design\r\n1. Title and subtitle explain key words that will be used in the graph. No additional transformation is done to the data, only using import, export, date, and country/region as the basis for the graph.\r\n2. The merchandise trading situation of the six countries is displayed on one graph, which makes it possible to measure their merchandise trading volume on the same scale and enables readers to read and compare import and export results across different years and different countries more easily.\r\n3. A Pyramid bar chart is used. On the one hand, it clearly shows the trend of changes in the import and export volume of each country over time in the vertical direction. On the other hand, it also enables readers to compare the differences in merchandise trade between different countries at the same time period horizontally.\r\n4. Colors of black and red are used to differentiate export and import visually.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\n1. Select used data\r\nSelect only the total merchandise imports and exports of the top 6 countries and paste into a new sheet using Microsoft Excel.\r\n2. Reorganize the dataset\r\nPut all six countries/regions under column D. Trade in column B is dummy variable with import and export. At the same time, the data of the US is multiplied by 100 and converted into ‘Thousand Dollars’, which is consistent with the data scale of other countries.\r\n\r\n3. Import the data into Tableau\r\n\r\n4. Rename headers\r\nRename ‘Thousand dollars’ to ‘Volume’.\r\n\r\n5. Change Data Type\r\nChange the data type of ‘Volume’ from String to Number (whole).\r\n\r\n6. Drag Month to Rows and sort order to Descending. Then drag Trade to Columns.\r\n\r\n7. Drag Volume to Columns and change its Measure to Sum.\r\n\r\n8. Add a calculated file for import and export respectively.\r\n\r\n9. Remove ‘Trade’ and ‘Volume’ from Columns and drag ‘Import’ and ‘Export’ to Columns instead.\r\n\r\n10. Edit Axis of ‘Export’ by Reversed.\r\n\r\nThe chart then looks like below.\r\n\r\n11. Change the ‘Export’ and ‘Import’ bars to black and red respectively to differentiate the trade type.\r\n\r\n12. Add filter\r\nSo far, the chart displays the total export and import of six countries monthly. We should add a filter for ‘Country/Region’ to observe the merchandise trade situation of each country. Select the desired Country/Region for observation. In this case, Hong Kong is chosen. Show the ‘Country/Region’ filter on the sidebar.\r\n\r\n13. The graph should now look like this.\r\n\r\n14. Select Single Value (list) under ‘Country/Region’ filter allows the chart to be displayed individually according to the country/region.\r\n\r\n15. Edit Title\r\nDouble click the title pane and select Country/Region under Insert tab. This allows the chart name to be automatically displayed based on the Country/Region.\r\n\r\n16. Right click on (All) and uncheck Show “All” Value under Customize.\r\n\r\n17. Drag Import and Export to Tooltip and then edit Tooltip to change Import to red and Export to dark. Also add $ and K symbols before and after <SUM(Import)> respectively.\r\n\r\n18. The base graph should look like this.\r\n\r\n19. Remove ‘Country/Region’ from ‘Filters’ pane and drag it to Columns to display all six charts simultaneously. Also edit the main title for the visualization.\r\n\r\n5.0 Derived insights\r\n\r\n1. Overall, from January 2019 to April 2021, merchandise trade in the top 6 countries has shown an upward trend. From an individual point of view, the United States is the only one of the six countries where merchandise trade has a decreasing trend.\r\n2. From the perspective of merchandise trade volume, Mainland China and the US are the two countries with the largest total transaction volume among the six countries, while Hong Kong and Japan are the two with the smallest total transaction volume. Roughly based on the area of the pyramid bar, the merchandise volume between China and the United States is more than twice that of Japan and Hong Kong.\r\n3. From the comparison of imports and exports, we can intuitively find that Hong Kong is an obvious export-oriented region. Correspondingly, Taiwan is a relatively typical import-oriented country. Japan and the United States have relatively balanced imports and exports. The import trade between Malaysia and China is slightly larger than the export trade. This is because the two countries have sufficient product resources and labor, so there is more surplus for export.\r\n4. From February to June 2020, these countries and regions have suddenly shortened bars, that is, merchandise trade has dropped significantly, which coincides with the time when COVID-19 broke out in these countries.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T19:44:29+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
